// menu.js
module.exports = {
  mainMenu: (pushname, pushwish, botname, OWNER_NAME, owner, prefix, hours, minutes, seconds, xtime, xdate, me, isPublic) => `
  Hi 👋 *${pushname}*
  *${pushwish}*
  
 ╔═════════════════╗
 ║   『 BOT INFO 』
 ║  ☬─────────────☬  
 ║ 🤖 *ʙᴏᴛ ɴᴀᴍᴇ*: *${botname}*
 ║ 👤 *ᴏᴡɴᴇʀ ɴᴀᴍᴇ*: *${OWNER_NAME}*
 ║ 👨‍💻 *ɴᴜᴍʙᴇʀ*: *${owner}*
 ║ 😎 *ᴅᴇᴘʟᴏʏᴇᴅ:* *𝙰𝙻𝙸 𝙰𝚂𝙶𝙷𝙰𝚁*
 ╠═════════════════╣
 ║ 🚀 *ᴘʀᴇғɪx*: *${prefix}*
 ║ ⏳ *ᴜᴘᴛɪᴍᴇ*: *${hours}h ${minutes}m ${seconds}s*
 ║ 🌐 *ᴍᴏᴅᴇ*: *${isPublic ? 'Public' : 'Self'}*
 ╠═════════════════╣
 ║   『 USER INFO 』 
 ║  ☬─────────────☬  
 ║ 🧑 *ɴᴀᴍᴇ*: ${pushname}
 ║ 📞 *ɴᴜᴍʙᴇʀ*: @${me.split('@')[0]}
 ║ ✅ *ᴘʀᴇᴍɪᴜᴍ*: ✅
 ╠═════════════════╣
 ║   『 TIME INFO 』 
 ║  ☬─────────────☬  
 ║ ⏰ *ᴛɪᴍᴇ*: *${xtime}*
 ║ 📅 *ᴅᴀᴛᴇ*: *${xdate}*
 ╠═════════════════╣
 ║    『 HELP 』
 ║  ☬─────────────☬  
 ║ 🆘 Please Type */help*
 ╠═════════════════╣
 ║  『 AI COMMANDS 』
 ║  ☬─────────────☬  
 ║ 1️⃣ *.𝙶𝙿𝚃*
 ║ 2️⃣ *.𝙸𝙼𝙶*
 ║ 3️⃣ *.𝙳𝙰𝙻𝙻𝙴*
 ║ 4️⃣ *.𝙱𝙰𝚁𝙳*
 ╠═════════════════╣
 ║   『 TOOLS MENU 』
 ║  ☬─────────────☬  
 ║ 🗣 *.𝚃𝚃𝚂*
 ║ 📋 *.𝙳𝙴𝙻𝙴𝚃𝙴*
 ║ 🌐 *.𝚃𝚁𝙰𝙽𝚂𝙻𝙰𝚃𝙴*
 ║ ℹ️ *.𝙸𝙽𝙵𝙾*
 ║ 🧬 *.𝙶𝙴𝚃𝙱𝙸𝙾*
 ║ 🖇️ *.𝚃𝙸𝙽𝚈𝚄𝚁𝙻*
 ║ 📧 *.𝚃𝙴𝙼𝙿𝙼𝙰𝙸𝙻*
 ║ 📩 *.𝙲𝙷𝙴𝙲𝙺𝙼𝙰𝙸𝙻*
 ╠═════════════════╣
 ║   『 GROUP MENU 』
 ║  ☬─────────────☬  
 ║ 🚫 *.𝙺𝙸𝙲𝙺 @𝚄𝚂𝙴𝚁*
 ║ 🚫 *.𝙱𝙰𝙽 @𝚄𝚂𝙴𝚁*
 ║ ➕ *.𝙰𝙳𝙳 @𝚄𝚂𝙴𝚁*
 ║ 👑 *.𝙿𝚁𝙾𝙼𝙾𝚃𝙴 @𝚄𝚂𝙴𝚁*
 ║ 👤 *.𝙳𝙴𝙼𝙾𝚃𝙴 @𝚄𝚂𝙴𝚁*
 ║ 📣 *.𝙶𝚁𝙾𝚄𝙿 𝙾𝙵𝙵/𝙾𝙽*
 ║ 🔗 *.𝙻𝙸𝙽𝙺𝙶𝙲*
 ║ 🕠 *.𝙲𝙻𝙾𝚂𝙴𝚃𝙸𝙼𝙴*
 ║ 🕥 *.𝙾𝙿𝙴𝙽𝚃𝙸𝙼𝙴*
 ║ ⛓️ *.𝙰𝙽𝚃𝙸𝙻𝙸𝙽𝙺𝙶𝙲*
 ║ 🗣️ *.𝙰𝙽𝚃𝙸𝚃𝙾𝚇𝙸*
 ║ 🚪 *.𝙻𝙴𝙰𝚅𝙴𝙶𝙲*
 ║ 📊 *.𝙿𝙾𝙻𝙻*
 ║ 🤝 *.𝙹𝙾𝙸𝙽*
 ║ 🚫 *.𝚁𝙴𝚅𝙾𝙺𝙴*
 ║ 💌 *.𝙸𝙽𝚅𝙸𝚃𝙴*
 ╠═════════════════╣
 ║  『 OWNER MENU 』
 ║  ☬─────────────☬  
 ║ ✏️ *.𝚂𝙴𝚃𝙽𝙰𝙼𝙴*
 ║ 📝 *.𝚂𝙴𝚃𝙱𝙸𝙾*
 ║ 🚫 *.𝙱𝙻𝙾𝙲𝙺*
 ║ ✅ *.𝚄𝙽𝙱𝙻𝙾𝙲𝙺*
 ║ 😴 *.𝚂𝙻𝙴𝙴𝙿*
 ║ 🔁 *.𝙰𝚄𝚃𝙾𝚁𝙴𝚀𝙳*
 ║ 🌐 *.𝚂𝙴𝙻𝙵*
 ║ 🌍 *.𝙿𝚄𝙱𝙻𝙸𝙲*
 ║ 🆕 *.𝙰𝙳𝙳𝙾𝚆𝙽𝙴𝚁*
 ║ 🚮 *.𝙳𝙴𝙻𝙾𝚆𝙽𝙴𝚁*
 ║ ➕ *.𝙰𝙳𝙳𝚁𝙿𝙴𝙼*
 ║ ➖ *.𝙳𝙴𝙻𝚁𝙿𝙴𝙼*
 ║ 🚫 *.𝙰𝙳𝙳𝙱𝙰𝙳𝚆𝙾𝚁𝙳*
 ║ 🚫 *.𝙳𝙴𝙻𝙱𝙰𝙳𝚆𝙾𝚁𝙳*
 ║ 📋 *.𝙻𝙸𝚂𝚃𝙿𝚁𝙴𝙼*
 ║ 🚫 *.𝙻𝙸𝚂𝚃𝙱𝙰𝙳𝚆𝙾𝚁𝙳*
 ║ 📝 *.𝙰𝚄𝚃𝙾𝚃𝚈𝙿𝙸𝙽𝙶*
 ║ 🌟 *.𝙰𝙻𝚆𝙰𝚈𝚂𝙾𝙽𝙻𝙸𝙽𝙴*
 ╠═══════════════╣
 ║  『 BUG REPORTING 』
 ║  ☬─────────────☬  
 ║ 🐞 *.𝙱𝚄𝙶*
 ╠═══════════════╣
 ║ [🎨]『 STICKER MENU 』
 ║  ☬─────────────☬  
 ║ 🎨 *.𝚂𝚃𝙸𝙲𝙺𝙴𝚁*
 ╠═══════════════╣
 ║  『 SEARCH MENU 』
 ║  ☬─────────────☬ 
 ║ 🔍 *.𝙶𝙾𝙾𝙶𝙻𝙴*
 ║ 📷 *.𝙸𝙽𝚂𝚃𝙰*
 ║ 📦 *.𝙰𝙿𝙺*
 ║ 🎬 *.𝚈𝚃𝚂*
 ║ 🌦️ *.𝚆𝙴𝙰𝚃𝙷𝙴𝚁*
 ║ 🎵 *.𝙻𝚈𝚁𝙸𝙲𝚂*
 ║ 🕵️️ *.𝙶𝙸𝚃𝙷𝚄𝙱𝚂𝚃𝙰𝙻𝙺*
 ║ 👤 *.𝙸𝙶𝚂*
 ╠═══════════════╣
 ║ 『 DOWNLOAD MENU 』
 ║ ☬─────────────☬ 
 ║ 📽️ *.𝚅𝙸𝙳𝙴𝙾*
 ║ 🎵 *.𝚂𝙾𝙽𝙶*
 ║ 📂 *.𝙵𝙱*
 ║ 📦 *.𝙶𝙳𝚁𝙸𝚅𝙴*
 ║ 📦 *.𝙶𝙸𝚃𝙲𝙻𝙾𝙽𝙴*
 ╠══════════════╣
 ║  『 ANIME 18+ MENU 』
 ║ ☬─────────────────☬ 
 ║ 🚫 *.𝙰𝙽𝚃𝙸𝙽𝚂𝙵𝚆*
 ║ 🔞 *.𝙽𝚂𝙵𝚆𝙼𝙴𝙽𝚄*
 ╚═══════════════╝
 ╔═══════════════╗
 ║🤖 𝐆𝐒𝐒_𝚩𝚯𝚻𝐖𝚫
 ║════════════════
 ║  👨‍💻 *𝐂𝐫𝐞𝐚𝐭𝐞𝐝 𝐛𝐲 𝐠𝐬𝐬 𝐭𝐞𝐚𝐦*
 ╚═══════════════╝
 ║ 𝚫𝐋𝚰 𝚫𝐒𝐆𝚮𝚫𝚪 𝐉𝚫𝚻𝚯𝚰
 ╚═══════════════╝
`,
  nsfwmenu: `
 ╔═══════════════╗
 ║   『 ANIME (18+) 』
 ║  ☬─────────────────☬  
 ║ 🍑 - .hentai 🅕 
 ║ 😺 - .neko  🅕 
 ║ 🙇♂️ - .trap   🅕 
 ║ 💦 - .gasm 🅕 
 ║ 😮 - .ahegao 🅕 
 ║ 🍑 - .ass 🅕 
 ║ 🔞 - .bdsm 🅕 
 ║ 👄 - .blowjob 🅕 
 ║ 👀 - .cuckold 🅕 
 ║ 💦 - .cum 🅕
 ║ 👩🦰 - .milf 🅕 
 ║ 🦄 - .eba 🅕 
 ║ 💋 - .ero 🅕 
 ║ 👠 - .femdom 🅕 
 ║ 👣 - .foot 🅕 
 ║ 🥂 - .gangbang 🅕
 ║ 👓 - .glasses 🅕 
 ║ 🎸 - .jahy 🅕 
 ║ 🍆 - .masturbation 🅕 
 ║ 📚 - .manga   🅕 
 ║ 😼 - .neko-hentai  🅕 
 ║ 😽 - .neko-hentai2 🅕 
 ║ 🍭 - .nsfwloli 🅕 
 ║ 🎉 - .orgy 🅕 
 ║ 👙 - .panties 🅕 
 ║ 🍑 - .pussy 🅕 
 ║ 🐙 - .tentacles 🅕
 ║ 🦵 - .thighs 🅕 
 ║ 👭 - .yuri 🅕 
 ║ 🩱 - .zettai 🅕 
 ╚═══════════════╝
 ╔═══════════════╗
 ║🤖 𝐆𝐒𝐒_𝚩𝚯𝚻𝐖𝚫
 ║════════════════
 ║  👨‍💻 *𝐂𝐫𝐞𝐚𝐭𝐞𝐝 𝐛𝐲 𝐠𝐬𝐬 𝐭𝐞𝐚𝐦*
 ╚═══════════════╝
 ║ 😎 *𝚫𝐋𝚰 𝚫𝐒𝐆𝚮𝚫𝚪 𝐉𝚫𝚻𝚯𝚰*
 ╚═══════════════╝
  `
};
